package 인프런알고리즘강좌;

import java.util.*;

public class ReSolve010 {
    public static void main(String[] args) {
        int[] arr = { 7033,23832,28248,3634,29188,471,20535,7295,16029,31704,28692,2949,7412,6358,16976,9584,30872,30711,1034,9010,5575,16206,10900,11811,7301,19108,26407,9450,23019,14200,4821,10145,11202,29252,5824,12084,19024,10498,9354,13322,25714,18159,21260,10216,16875,23951,29515,18194,24572,7921,12711,1203,15413,19764,22358,5758,16778,17226,16401,25494,2985,31484,22541,23211,29835,13358,13869,29542,8265,8549,9846,24328,31538,15750,14531,11342,24090,12001,10170,25239,19700,23405,11262,22600,932,4693,4006,18544,17678,28340,5615,27560,8307,22429,2861,6206,8445,16735,4360,11666 };
        int max = digit_sum(arr[0]);
        int answer = 0;

        for(int i=1; i<arr.length; i++) {
            int min = digit_sum(arr[i]);
            if(min > max) {
                max = min;
                answer = arr[i];
            } else if(min == max) {
                answer = Math.max(answer, arr[i]);
            }
        }

        System.out.println(answer);
    }

    public static int digit_sum(int x) {
        int tmp = 0;
        int answer = 0;
        // 10으로 나눠서 자릿수로 계산

        while(x > 0) {
            tmp = x % 10;
            answer = answer + tmp;
            x = x / 10;
        }

        return answer;
    }
}
